[{
    "id": 1,
    "title": "How My Cactus Withered",
    "body": "They say cacti are almost maintenance-free. Yeah, tell that to mine! I forgot about it a couple of times, then overcompensated by drowning it in water. It decided life was too complicated and gave up. Now I own a spiky... mummy.",
    "date": "2024-10-01",
    "image": "https://images.pexels.com/photos/712698/pexels-photo-712698.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
}, {
    "id": 2,
    "title": "Where Do Gnats in Plants Come From?",
    "body": "Tiny flying creatures that, for some reason, think my flower pots are their home. Overwatering and organic fertilizers attract them. I fight back by drying the soil, using cinnamon powder, and setting sticky traps. Anyone else battling these invaders?",
    "date": "2024-10-02",
    "image": "https://images.pexels.com/photos/3153522/pexels-photo-3153522.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
}, {
    "id": 3,
    "title": "How to Water Begonia Properly?",
    "body": "The secret to a beautiful begonia is moderate watering. The soil should be moist but not swampy. Water at the base, avoiding the leaves. And most importantly—don’t overdo it, or it’ll start rotting. My rule: when in doubt, wait a day!",
    "date": "2024-10-03",
    "image": "https://images.pexels.com/photos/28992494/pexels-photo-28992494.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
}, {
    "id": 4,
    "title": "Grafting an Apple Tree: My First Failure",
    "body": "I tried grafting one tree onto another. Followed all the steps: sharp knife, rootstock, scion, tape... Only to realize a week later that I had grafted the wrong branch! I think my apple trees are in shock. Time to try again.",
    "date": "2024-10-04",
    "image": "https://images.pexels.com/photos/1094211/pexels-photo-1094211.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
}, {
    "id": 5,
    "title": "Favorite Plant? Definitely Monstera!",
    "body": "It grows fast, its huge leaves look like a jungle, and it requires minimal care. The only downside? Why does it insist on growing taller instead of wider? In a year, I’ll either need a support or have to divide the monster.",
    "date": "2024-10-05",
    "image": "https://images.pexels.com/photos/30937901/pexels-photo-30937901.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
}, {
    "id": 6,
    "title": "Once, I Planted a Lemon...",
    "body": "From an ordinary seed! A few months later, the first leaves appeared, and after a year—an actual bush. No fruits yet, but the fact that a tiny seed turned into a tree is exciting. Now, we wait... maybe three more years?",
    "date": "2024-10-06",
    "image": "https://images.pexels.com/photos/18120054/pexels-photo-18120054.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
}, {
    "id": 7,
    "title": "Spring Means Repotting!",
    "body": "My plants are getting fresh soil, new pots, and a boost of nutrients. The succulents, as always, handle it like champs, but my ficus gave me a look as if I had betrayed its trust. Hope it forgives me!",
    "date": "2024-10-07",
    "image": "https://images.pexels.com/photos/1373896/pexels-photo-1373896.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
}, {
    "id": 8,
    "title": "The Picky African Violet",
    "body": "Water it too much—it rots. Water it too little—it dries out. Put it in direct sunlight—its leaves turn yellow. Keep it in the shade—it won’t bloom. African violets are true aristocrats, but when they finally bloom, it’s all worth it.",
    "date": "2024-10-08",
    "image": "https://images.pexels.com/photos/8327226/pexels-photo-8327226.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
}, {
    "id": 9,
    "title": "A Gardener’s Joy",
    "body": "Today, my avocado sprouted a new leaf! I’ve been growing it for two years now, and every new leaf feels like a little victory. Maybe in 15 years, it will even bear fruit?",
    "date": "2024-10-09",
    "image": "https://images.pexels.com/photos/7318145/pexels-photo-7318145.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
}, {
    "id": 10,
    "title": "Saying Goodbye to a Favorite Plant",
    "body": "Sometimes, you have to say goodbye to your green friends. Root rot, pests, or just something gone wrong—it happens. Today, I parted with my peperomia, but I’ve already placed a new pot in its spot. Life goes on!",
    "date": "2024-10-10",
    "image": "https://images.pexels.com/photos/1302305/pexels-photo-1302305.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1"
}]